[{"name":"Yirong Zhou, Ph.D. candidate","introduction":"Yirong Zhou was born in Wuhan, Hubei, China in 1994. He received B.S. in Statistics from the University of Science and Technology of China, in 2017 and M.S. in Statistics from George Washington University, in 2019. He is a current Ph.D. Student in Civil & Environmental Engineering at the University of Utah under the supervision of Prof. Xiaoyue Cathy Liu. His research focuses on data-driven transportation system modeling.","Email":" yirong.zhou@utah.edu","PhotoUrl":"brand/yirong.jpg"},{"name":"Zhiyan Yi, Ph.D. candidate","introduction":"Zhiyan received his M.S degree in Transportation Science & Engineering department in Beihang University in 2018. He is currently a Ph.D. student in the third year. His research interests include spatio-temporal analysis, data-driven strategies, and electrical vehicle charging demand analysis.","Email":"zhiyan.yi@utah.edu","PhotoUrl":"brand/zhiyan.jpg"},{"name":"N. Nima Haghighi, Ph.D. (graduated)","introduction":"Nima graduated from Sharif University of Technology and received his Ph.D degree in 2019. He is experienced in mining spatiotemporal and crowdsourced traffic data (e.g. HERE data, social media data, and Bluetooth data). Now, he is a transportation planner at Pasco County Government.","Email":"nima.haghighi@utah.edu","PhotoUrl":"brand/nima.jpg"},{"name":"S. Kiavash Fayyaz (graduated)","introduction":"Kiavash received his Ph.D. degree in 2017. Previously, he hold a B.S. degree in University of Tehran, and M.S. degree in Institut Mines-Telecom Business School majoring International Management. Now he works at Amazon Web Services (AWS) as Network Developer Engineer.","Email":"kiavash.fayyaz@rsginc.com","PhotoUrl":"brand/Kiavash.jpg"},{"name":"Zhuo Chen, Research Assistant Professor (graduated)","introduction":"Introduction of Zhuo Chen, TBD","Email":"zhuo.chen@utah.edu","PhotoUrl":"brand/zhuochen2.jpg"},{"name":"Qian Zuo, M.S. (graduated)","introduction":"Qian Zuo received her master degree in Computer Science in the University of Utah in 2019. She is working as a software engineer developer in Wework. ","Email":"gracezq1988@gmail.com","PhotoUrl":"brand/qianzuo.jpg"},{"name":"Ruoyang Shen M.S. (graduated)","introduction":"Introduction of Zhuo Chen, TBD","Email":"nashengruoyang@gmail.com","PhotoUrl":"brand/qianzuo.jpg"}]
